sm = float(input('ВВЕДИТЕ СУММУ: '))
if 0 < sm <= 10000.00:
    print('Госпошлина: ', 200.00)
elif 10000.00 < sm <= 20000.00:
    gp1 = (sm * 0.0004)/2
    print('Госпошлина: ', float('%.2f' % gp1))
elif 20000.00 < sm <= 100000.00:
    gp2 = ((((sm - 20000) * 0.03)+800)/2)
    print('Госпошлина: ', float('%.2f' % gp2))
elif 100000.00 < sm <= 200000.00:
    gp3 = ((((sm - 100000) * 0.02) + 3200) / 2)
    print('Госпошлина: ', float('%.2f' % gp3))
elif 200000.00 < sm <= 1000000.00:
    gp4 = ((((sm - 200000) * 0.01) + 5200) / 2)
    print('Госпошлина: ', float('%.2f' % gp4))
elif sm > 1000000.00:
    gp5 = ((((sm - 1000000) * 0.005) + 13200) / 2)
    print('Госпошлина: ', float('%.2f' % gp5))